---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
source: html/4e416b32-0ed2-7b89-c812-5a70456dc4df.htm
---
# VertexPositionNormalColored Properties

Specifies whether the .NET object represents a valid Revit entity.